Revit 2024 API
ExportLineweightKey Constructor (ExportLineweightKey)
 Constructs a new copy of the input ExportLineweightKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportLineweightKey(
	ExportLineweightKey other
)
Visual Basic
Public Sub New ( _
	other As ExportLineweightKey _
)
Visual C++
public:
ExportLineweightKey(
	ExportLineweightKey^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExportLineweightKey
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportLineweightKey Class
ExportLineweightKey Overload
Autodesk.Revit.DB Namespace